package com.ahmedabdelmohsen.digisebhaa;

import com.ahmedabdelmohsen.digisebhaa.pojo.SebhaDao;
import com.ahmedabdelmohsen.digisebhaa.pojo.SebhaModel;

public class Data {
    public void getAllData(SebhaDao sebhaDao) {
        sebhaDao.insert(new SebhaModel(1, "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ\n" +
                " اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ."
                , "[آية الكرسي – البقرة 255]."
                , "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح."
                , "مرة واحدة"
                , 0
                , 1
                , 1));

        sebhaDao.insert(new SebhaModel(2, "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \n" +
                " قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.\n" +
                "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.\n" +
                "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ."
                , "[الإخلاص والمعوذتين]."
                , "من قالها حين يصبح وحين يمسى كفته من كل شيء."
                , "ثلاث مرات"
                , 0
                , 3
                , 2));

        sebhaDao.insert(new SebhaModel(3, "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شيء قدير، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُ بِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.\n" +
                "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ، خَلَقْتَنـي وَأَنا عَبْـدُك، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت، أَعـوذُ بِكَ مِنْ شَـرِّ ما صَنَـعْت، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ."
                , "[أذكار]."
                , "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح."
                , "مرة واحدة"
                , 0
                , 1
                , 3));

        sebhaDao.insert(new SebhaModel(4, "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً."
                , "[أذكار]."
                , "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة."
                , "ثلاث مرات"
                , 0
                , 3
                , 4));

        sebhaDao.insert(new SebhaModel(5, "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك، وَمَلَائِكَتَكَ، وَجَمـيعَ خَلْـقِك، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك."
                , "[أذكار]."
                , "من قالها أعتقه الله من النار."
                , "أربع مرات"
                , 0
                , 4
                , 5));

        sebhaDao.insert(new SebhaModel(6, "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر."
                , "[أذكار]."
                , "من قالها حين يصبح أدى شكر يومه."
                , "مرة واحدة"
                , 0
                , 1
                , 6));

        sebhaDao.insert(new SebhaModel(7, "اَللّهُمَّ اجْعَلْ صِيامي فيهِ صِيامَ الصّائِمينَ وَقِيامي فيِهِ قِيامَ القائِمينَ، وَنَبِّهْني فيهِ عَن نَوْمَةِ الغافِلينَ، وَهَبْ لي جُرمي فيهِ يا اِلهَ العالمينَ، وَاعْفُ عَنّي يا عافِياً عَنِ المُجرِمينَ."
                , "[أذكار]."
                , "دعاء شهر رمضان"
                , "مرة واحدة"
                , 0
                , 1
                , 7));

        sebhaDao.insert(new SebhaModel(8, "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم."
                , "[أذكار]."
                , "لم يضره من الله شيء."
                , "ثلاث مرات"
                , 0
                , 3
                , 8));

        sebhaDao.insert(new SebhaModel(9, "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور."
                , "[أذكار]."
                , "كان النبي يدعو بها."
                , "مرة واحدة"
                , 0
                , 1
                , 9));

        sebhaDao.insert(new SebhaModel(10, "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ."
                , "[أذكار]."
                , "كان النبي يدعو بها."
                , "مرة واحدة"
                , 0
                , 1
                , 10));

        sebhaDao.insert(new SebhaModel(11, "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه، وَرِضـا نَفْسِـه، وَزِنَـةَ عَـرْشِـه، وَمِـدادَ كَلِمـاتِـه."
                , "[أذكار]."
                , "خير من الجلوس للذكر."
                , "ثلاث مرات"
                , 0
                , 3
                , 11));

        sebhaDao.insert(new SebhaModel(12, "اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري، لا إلهَ إلاّ أَنْـتَ.\n"
                , "[أذكار]."
                , "ورد دعاء النبي صلى الله عليه وسلم به."
                , "ثلاث مرات"
                , 0
                , 3
                , 12));

        sebhaDao.insert(new SebhaModel(13, "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر، وَالفَـقْر، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر، لا إلهَ إلاّ أَنْـتَ."
                , "[أذكار]."
                , "كان النبي يدعو بها."
                , "ثلاث مرات"
                , 0
                , 3
                , 13));

        sebhaDao.insert(new SebhaModel(14, "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي، وَمِن فَوْقـي، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي."
                , "[أذكار]."
                , "لم يكن الرسول صلى الله عليه وسلم يدعها صباحاً."
                , "مرة واحدة"
                , 0
                , 1
                , 14));

        sebhaDao.insert(new SebhaModel(15, "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ."
                , "[أذكار]."
                , "أوصى به النبي صلى الله عليه وسلم فاطمة رضي الله عنها."
                , "ثلاث مرات"
                , 0
                , 3
                , 15));

        sebhaDao.insert(new SebhaModel(16, "أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم، فَـتْحَهُ، وَنَصْـرَهُ، وَنـورَهُ وَبَـرَكَتَـهُ، وَهُـداهُ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه."
                , "[أذكار]."
                , "أذكار الصباح من الواجب قراءتها"
                , "مرة واحدة"
                , 0
                , 1
                , 16));

        sebhaDao.insert(new SebhaModel(17, "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم."
                , "[أذكار]."
                , "أذكار الصباح من الواجب قراءتها"
                , "مرة واحدة"
                , 0
                , 1
                , 17));

        sebhaDao.insert(new SebhaModel(18, "لا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ."
                , "[أذكار]."
                , "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان."
                , "مائة مرة"
                , 0
                , 100
                , 18));

        sebhaDao.insert(new SebhaModel(19, "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق."
                , "[أذكار]."
                , "محصنة للأماكن من كل ضرر"
                , "ثلاث مرات"
                , 1
                , 3
                , 19));

        sebhaDao.insert(new SebhaModel(20, "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد."
                , "[أذكار]."
                , "الصلاة على النبي صلى الله عليه وسلم في كل حال واجبة وجوب السنن المؤكدة"
                , "عشر مرات"
                , 0
                , 10
                , 20));

        sebhaDao.insert(new SebhaModel(21, "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْه."
                , "[أذكار]."
                , "كتب له مائة حسنة ومحيت عنه مائة سيئة وكانت له حرزا من الشيطان يومه ذلك حتى يمسي"
                , "مائة مرة"
                , 0
                , 100
                , 21));

        sebhaDao.insert(new SebhaModel(22, "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ\n" +
                " اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ."
                , "[آية الكرسي – البقرة 255]."
                , "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح."
                , "مرة واحدة"
                , 1
                , 1
                , 1));

        sebhaDao.insert(new SebhaModel(23, "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \n" +
                " قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.\n" +
                "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.\n" +
                "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ."
                , "[الإخلاص والمعوذتين]."
                , "من قالها حين يصبح وحين يمسى كفته من كل شيء."
                , "ثلاث مرات"
                , 1
                , 3
                , 2));

        sebhaDao.insert(new SebhaModel(24, "أمسينا وَأَمسي المُـلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذه الليلة وَخَـيرَ ما بَعْـدَها، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذه الليلة وَشَرِّ ما بَعْـدَها، رَبِّ أَعـوذُ بِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر."
                , "[أذكار]."
                , "أذكار المساء من الواجب قراءتها"
                , "مرة واحدة"
                , 1
                , 1
                , 3));


        sebhaDao.insert(new SebhaModel(25, "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ، عَلَيْكَ تَوَكَّلْتُ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ، مَا شَاءَ اللَّهُ كَانَ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ، أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ."
                , "[أذكار]."
                , "من قالها موقناً بها حين يمسي ومات ليلتها دخل الجنة."
                , "مرة واحدة"
                , 1
                , 1
                , 4));

        sebhaDao.insert(new SebhaModel(26, "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً."
                , "[أذكار]."
                , "من قالها حين يمسي  كان حقا على الله أن يرضيه يوم القيامة."
                , "ثلاث مرات"
                , 1
                , 3
                , 5));

        sebhaDao.insert(new SebhaModel(27, "اللّهُـمَّ إِنِّـي أمسيت أُشْـهِدُك، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك، وَمَلَائِكَتَكَ، وَجَمـيعَ خَلْـقِك، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك."
                , "[أذكار]."
                , "من قالها أعتقه الله من النار."
                , "أربع مرات"
                , 1
                , 4
                , 6));

        sebhaDao.insert(new SebhaModel(28, "اللّهُـمَّ ما أمسي بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر."
                , "[أذكار]."
                , "من قالها حين يمسي فقد أدى شكر ليلته."
                , "مرة واحدة"
                , 1
                , 1
                , 7));

        sebhaDao.insert(new SebhaModel(29, "اَللّهُمَّ اجْعَلْ صِيامي فيهِ صِيامَ الصّائِمينَ وَقِيامي فيِهِ قِيامَ القائِمينَ، وَنَبِّهْني فيهِ عَن نَوْمَةِ الغافِلينَ، وَهَبْ لي جُرمي فيهِ يا اِلهَ العالمينَ، وَاعْفُ عَنّي يا عافِياً عَنِ المُجرِمينَ."
                , "[أذكار]."
                , "دعاء شهر رمضان"
                , "مرة واحدة"
                , 1
                , 1
                , 8));
        sebhaDao.insert(new SebhaModel(30, "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم."
                , "[أذكار]."
                , "لا يضره شيء."
                , "ثلاث مرات"
                , 1
                , 3
                , 9));

        sebhaDao.insert(new SebhaModel(31, "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ المصير."
                , "[أذكار]."
                , "أذكار المساء من الواجب قراءتها"
                , "مرة واحدة"
                , 1
                , 1
                , 10));
        sebhaDao.insert(new SebhaModel(32, "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ المصير."
                , "[أذكار]."
                , "أذكار المساء من الواجب قراءتها"
                , "مرة واحدة"
                , 1
                , 1
                , 11));

        sebhaDao.insert(new SebhaModel(33, "أَمسينا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ."
                , "[أذكار]."
                , "كان النبي يدعو بها."
                , "مرة واحدة"
                , 1
                , 1
                , 12));

        sebhaDao.insert(new SebhaModel(34, "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه، وَرِضـا نَفْسِـه، وَزِنَـةَ عَـرْشِـه، وَمِـدادَ كَلِمـاتِـه."
                , "[أذكار]."
                , "خير من الجلوس للذكر"
                , "ثلاث مرات"
                , 1
                , 3
                , 13));

        sebhaDao.insert(new SebhaModel(35, "اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري، لا إلهَ إلاّ أَنْـتَ."
                , "[أذكار]."
                , "ورد دعاء النبي صلى الله عليه وسلم به."
                , "ثلاث مرات"
                , 1
                , 3
                , 14));

        sebhaDao.insert(new SebhaModel(36, "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر، وَالفَـقْر، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر، لا إلهَ إلاّ أَنْـتَ."
                , "[أذكار]."
                , "أذكار المساء من الواجب قراءتها"
                , "ثلاث مرات"
                , 1
                , 3
                , 15));
        sebhaDao.insert(new SebhaModel(37, "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي، وَمِن فَوْقـي، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي."
                , "[أذكار]."
                , "لم يكن الرسول صلى الله عليه وسلم يدعها حين يمسي."
                , "مرة واحدة"
                , 1
                , 1
                , 16));

        sebhaDao.insert(new SebhaModel(38, "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ."
                , "[أذكار]."
                , "أوصى به النبي صلى الله عليه وسلم فاطمة رضي الله عنها."
                , "ثلاث مرات"
                , 1
                , 3
                , 17));

        sebhaDao.insert(new SebhaModel(39, "أمسينا وَأَمسي المُـلكُ للهِ رَبِّ العـالَمـين، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذه الـليلة، فَـتْحَهُا، وَنَصْـرَهُا، وَنـورَهُا وَبَـرَكَتَـهُا، وَهُـداهُا، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِا وَشَـرِّ ما بَعْـدَها."
                , "[أذكار]."
                , "أذكارالمساء من الواجب قراءتها"
                , "مرة واحدة"
                , 1
                , 1
                , 18));

        sebhaDao.insert(new SebhaModel(40, "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم."
                , "[أذكار]."
                , "أذكار الصباح والمساء من الواجب قراءتها"
                , "مرة واحدة"
                , 1
                , 1
                , 19));

        sebhaDao.insert(new SebhaModel(41, "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق."
                , "[أذكار]."
                , "محصنة للأماكن من كل ضرر."
                , "ثلاث مرات"
                , 1
                , 3
                , 20));

        sebhaDao.insert(new SebhaModel(42, "سُبْحـانَ اللهِ وَبِحَمْـدِهِ."
                , "[أذكار]."
                , "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ."
                , "مائة مرة"
                , 1
                , 100
                , 21));

        sebhaDao.insert(new SebhaModel(43, "عن أبي هريرة رضي الله عنه أنَّ النَّبِيَّ صلَّى الله عليه وسلم قال: «يقول الله عزَّ وجلَّ: أنا عند ظن عبدي بي، وأنا معه حين يذكرني، فإن ذكرني في نفسه ذكرته في نفسي، وإن ذكرني في ملأ ذكرته في ملأٍ هُمْ خير منهم»."
                , "[حديث شريف]."
                , ""
                , "صحيح البخاري"
                , 2
                , 0
                , 1));

        sebhaDao.insert(new SebhaModel(44, "ن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال: «ألا أخبركم بخير أعمالكم وأزكاها عند مليككم، وأرفعها في درجاتكم، وخير لكم من إنفاق الذهب والفضة، وخير لكم مِنْ أَنْ تلقَوْا عدوَّكُمْ فتضربوا أعناقهم ويضربوا أعناقكم؟» قالوا: \"بلى يا رسول الله\"! قال: «ذكر الله عز وجل»."
                , "[حديث شريف]."
                , ""
                , "سنن الترمذي"
                , 2
                , 0
                , 2));

        sebhaDao.insert(new SebhaModel(45, "ن أبي هريرة رضي الله عنه قال: \"كان رسول الله صلى الله عليه وسلم يسير في طريقه إلى مكة، فمرَّ على جبل يقال له جمدان\" فقال: «سيروا هذا جمدان، سبق المُفَرِّدُونَ». قالوا: \"وما المُفَرِّدونَ يا رسول الله\"؟! قال: «الذاكرون الله كثيرًا والذاكرات»"
                , "[حديث شريف]."
                , ""
                , "صحيح مسلم"
                , 2
                , 0
                , 3));

        sebhaDao.insert(new SebhaModel(46, "عن أنس رضِي الله عنه قال: قال رسول الله صلى الله عليه وسلم: «لأن أقعد مع قوم يذكرون الله منذ صلاة الغداة حتَّى تطلع الشمس، أَحَبُّ إليَّ من أن أعتق أربعة من ولد إسماعيل، ولأن أَقْعُدَ مع قوم يذكرون الله من صلاة العصر إلى أن تغرب الشمس، أَحَبُّ إليَّ من أعتق أربعة»."
                , "[حديث شريف]."
                , ""
                , "سنن أبي داود"
                , 2
                , 0
                , 4));

        sebhaDao.insert(new SebhaModel(47, "عن أبي هريرة رضي الله عنه أن النبي صلَّى الله عليه وسلم قال: «من قال لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، في يوم مائة مرة،كانت له عدل عشر رقاب، وكتبت له مائة حسنة، ومحيت عنه مائة سيئة، وكانت له حرزًا من الشيطان يومه ذلك حتى يُمْسِيَ، ولم يأتِ أحد بأفضل مما جاء به إلا رجل عمل أكثر منه، ومن قال: سبحان الله وبحمده في يوم مائة مرة، حُطَّتْ خطاياه وإن كانت كانت مثل زبد البحر»."
                , "[حديث شريف]."
                , ""
                , "صحيح البخاري"
                , 2
                , 0
                , 5));

        sebhaDao.insert(new SebhaModel(48, "قال رسول الله صلى الله عليه وسلم: (لَعَنَ رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ المُتَشَبِّهِينَ مِنَ الرِّجَالِ بالنِّسَاءِ، والمُتَشَبِّهَاتِ مِنَ النِّسَاءِ بالرِّجَالِ)."
                , "[حديث شريف]."
                , ""
                , "صحيح البخاري"
                , 2
                , 0
                , 6));

        sebhaDao.insert(new SebhaModel(49, "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: «لأن أقول سبحان الله والحمد لله، ولا إله إلا الله والله أكبر، أَحَبُّ إليَّ مِمَّا طَلَعَتْ عليْهِ الشَّمْسُ»"
                , "[حديث شريف]."
                , ""
                , "صحيح البخاري"
                , 2
                , 0
                , 7));

        sebhaDao.insert(new SebhaModel(50, "عن بن عباس عن جويرية: \"أن النبي صلى الله عليه وسلم خرج من عندها بكرة، حين صلى الصبح، وهي في مسجدها ثم رجع بعد أن أضحى\". فقال: «مازلتِ على الحال التي فارقتك عليها؟» قالت: \"نعم\"، قال النبي صلى الله عليه وسلم: «لقد قلتُ بعدكِ أربع كلمات، ثلاث مرات، لو وُزنتْ بما قلتِ منذ اليوم لوزنتهن: سبحان الله وبحمده، عدد خلقه، ورضا نفسه، وزنة عرشه، ومداد كلماته»"
                , "[حديث شريف]."
                , ""
                , "صحيح البخاري"
                , 2
                , 0
                , 8));

        sebhaDao.insert(new SebhaModel(51, "عن شداد بن أوس رضي الله عنه عن النبي صلى الله عليه وسلم قال: «سيد الاستغفار أن يقول العبد: اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك عليَّ، وأبوء بذنبي، فاغفر لي فإنه لا يغفر الذنوب إلا أنت. قال: وَمَنْ قالها من النهار موقنًا بها فمات من يومه قبل أن يمسي فهو من أهل الجنة، ومن قالها من الليل وهو مُوقن بها، فمات قبل أن يصبح فهو من أهل الجنة»"
                , "[حديث شريف]."
                , ""
                , "صحيح البخاري"
                , 2
                , 0
                , 9));

        sebhaDao.insert(new SebhaModel(52, "قال رسول الله صلى الله عليه وسلم: (قالَ اللَّهُ تَبارَكَ وتَعالَى: أنا أغْنَى الشُّرَكاءِ عَنِ الشِّرْكِ، مَن عَمِلَ عَمَلًا أشْرَكَ فيه مَعِي غيرِي، تَرَكْتُهُ وشِرْكَهُ)."
                , "[حديث شريف]."
                , ""
                , "صحيح مسلم"
                , 2
                , 0
                , 10));

        sebhaDao.insert(new SebhaModel(53, "قال رسول الله صلى الله عليه وسلم: (الْمُؤْمِنُ القَوِيُّ، خَيْرٌ وَأَحَبُّ إلى اللهِ مِنَ المُؤْمِنِ الضَّعِيفِ، وفي كُلٍّ خَيْرٌ احْرِصْ علَى ما يَنْفَعُكَ، وَاسْتَعِنْ باللَّهِ وَلَا تَعْجَزْ، وإنْ أَصَابَكَ شيءٌ، فلا تَقُلْ لو أَنِّي فَعَلْتُ كانَ كَذَا وَكَذَا، وَلَكِنْ قُلْ قَدَرُ اللهِ وَما شَاءَ فَعَلَ، فإنَّ لو تَفْتَحُ عَمَلَ الشَّيْطَانِ)."
                , "[حديث شريف]."
                , ""
                , "صحيح مسلم"
                , 2
                , 0
                , 11));
        sebhaDao.insert(new SebhaModel(54, "قال رسول الله صلى الله عليه وسلم: (إنَّ اللَّهَ يَرْفَعُ بهذا الكِتَابِ أَقْوَامًا، وَيَضَعُ به آخَرِينَ)."
                , "[حديث شريف]."
                , ""
                , "صحيح مسلم"
                , 2
                , 0
                , 12));
        sebhaDao.insert(new SebhaModel(55, "قال رسول الله صلى الله عليه وسلم: (لا تَجْعَلُوا بُيُوتَكُمْ مَقابِرَ، إنَّ الشَّيْطانَ يَنْفِرُ مِنَ البَيْتِ الذي تُقْرَأُ فيه سُورَةُ البَقَرَةِ)."
                , "[حديث شريف]."
                , ""
                , "صحيح مسلم"
                , 2
                , 0
                , 13));
        sebhaDao.insert(new SebhaModel(56, "قال رسول الله صلى الله عليه وسلم: (مَن حَفِظَ عَشْرَ آياتٍ مِن أوَّلِ سُورَةِ الكَهْفِ عُصِمَ مِنَ الدَّجَّالِ)."
                , "[حديث شريف]."
                , ""
                , "صحيح مسلم"
                , 2
                , 0
                , 14));
        sebhaDao.insert(new SebhaModel(57, "قال رسول الله صلى الله عليه وسلم: (مَن نَفَّسَ عن مُؤْمِنٍ كُرْبَةً مِن كُرَبِ الدُّنْيَا، نَفَّسَ اللَّهُ عنْه كُرْبَةً مِن كُرَبِ يَومِ القِيَامَةِ، وَمَن يَسَّرَ علَى مُعْسِرٍ، يَسَّرَ اللَّهُ عليه في الدُّنْيَا وَالآخِرَةِ، وَمَن سَتَرَ مُسْلِمًا، سَتَرَهُ اللَّهُ في الدُّنْيَا وَالآخِرَةِ، وَاللَّهُ في عَوْنِ العَبْدِ ما كانَ العَبْدُ في عَوْنِ أَخِيهِ، وَمَن سَلَكَ طَرِيقًا يَلْتَمِسُ فيه عِلْمًا، سَهَّلَ اللَّهُ له به طَرِيقًا إلى الجَنَّةِ، وَما اجْتَمع قَوْمٌ في بَيْتٍ مِن بُيُوتِ اللهِ، يَتْلُونَ كِتَابَ اللهِ، وَيَتَدَارَسُونَهُ بيْنَهُمْ، إِلَّا نَزَلَتْ عليهمِ السَّكِينَةُ، وَغَشِيَتْهُمُ الرَّحْمَةُ وَحَفَّتْهُمُ المَلَائِكَةُ، وَذَكَرَهُمُ اللَّهُ فِيمَن عِنْدَهُ، وَمَن بَطَّأَ به عَمَلُهُ، لَمْ يُسْرِعْ به نَسَبُهُ. غيرَ أنَّ حَدِيثَ أَبِي أُسَامَةَ ليسَ فيه ذِكْرُ التَّيْسِيرِ علَى المُعْسِرِ)."
                , "[حديث شريف]."
                , ""
                , "صحيح مسلم"
                , 2
                , 0
                , 15));
    }
}
