package com.example.digisebhaa;

import com.example.digisebhaa.pojo.SebhaDao;
import com.example.digisebhaa.pojo.SebhaModel;

public class Data {
    public void getAllData(SebhaDao sebhaDao) {
        sebhaDao.insert(new SebhaModel("بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ\n" +
                " اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ."
                , "[آية الكرسي – البقرة 255]."
                , "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح."
                , "مرة واحدة"
                , 0));


        sebhaDao.insert(new SebhaModel("بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \n" +
                " قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.\n" +
                "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.\n" +
                "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ."
                , "[الإخلاص والمعوذتين]."
                , "من قالها حين يصبح وحين يمسى كفته من كل شيء."
                , "ثلاث مرات"
                , 0));

        sebhaDao.insert(new SebhaModel("أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شيء قدير، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُ بِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.\n" +
                "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ، خَلَقْتَنـي وَأَنا عَبْـدُك، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت، أَعـوذُ بِكَ مِنْ شَـرِّ ما صَنَـعْت، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ."
                , "[أذكار]."
                , "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح."
                , "مرة واحدة"
                , 0));

        sebhaDao.insert(new SebhaModel("رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً."
                , "[أذكار]."
                , "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة."
                , "ثلاث مرات"
                , 1));

        sebhaDao.insert(new SebhaModel("اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك، وَمَلَائِكَتَكَ، وَجَمـيعَ خَلْـقِك، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك."
                , "[أذكار]."
                , "من قالها أعتقه الله من النار."
                , "أربع مرات"
                , 0));

        sebhaDao.insert(new SebhaModel("اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر."
                , "[أذكار]."
                , "من قالها حين يصبح أدى شكر يومه."
                , "مرة واحدة"
                , 0));

        sebhaDao.insert(new SebhaModel("حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم."
                , "[أذكار]."
                , "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة."
                , "مرة واحدة"
                , 1));

        sebhaDao.insert(new SebhaModel("بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم."
                , "[أذكار]."
                , "لم يضره من الله شيء."
                , "ثلاث مرات"
                , 0));

        sebhaDao.insert(new SebhaModel("اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور. مرة واحدة\n" +
                "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.\n" +
                "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه، وَرِضـا نَفْسِـه، وَزِنَـةَ عَـرْشِـه، وَمِـدادَ كَلِمـاتِـه.\n" +
                "اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري، لا إلهَ إلاّ أَنْـتَ.\n" +
                "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر، وَالفَـقْر، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر، لا إلهَ إلاّ أَنْـتَ."
                , "[أذكار]."
                , "أذكار الصباح من الواجب قراءتها صباحا من بعد صلاة الفجر حتى الشروق"
                , "ثلاث مرات"
                , 0));

        sebhaDao.insert(new SebhaModel("اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي، وَمِن فَوْقـي، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي."
                , "[أذكار]."
                , "أذكار الصباح من الواجب قراءتها"
                , "مرة واحدة"
                , 0));

        sebhaDao.insert(new SebhaModel("يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ."
                , "[أذكار]."
                , "أذكار الصباح من الواجب قراءتها"
                , "ثلاث مرات"
                , 0));

        sebhaDao.insert(new SebhaModel("أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم، فَـتْحَهُ، وَنَصْـرَهُ، وَنـورَهُ وَبَـرَكَتَـهُ، وَهُـداهُ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه."
                , "[أذكار]."
                , "أذكار الصباح من الواجب قراءتها"
                , "مرة واحدة"
                , 0));

        sebhaDao.insert(new SebhaModel("اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم."
                , "[أذكار]."
                , "أذكار المساء من الواجب قراءتها"
                , "مرة واحدة"
                , 1));

        sebhaDao.insert(new SebhaModel("أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق."
                , "[أذكار]."
                , "أذكار المساء من الواجب قراءتها"
                , "ثلاث مرات"
                , 1));

        sebhaDao.insert(new SebhaModel("اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد."
                , "[أذكار]."
                , "الصلاة على النبي صلى الله عليه وسلم في كل حال واجبة وجوب السنن المؤكدة"
                , "عشر مرات"
                , 0));

        sebhaDao.insert(new SebhaModel("اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ."
                , "[أذكار]."
                , "أذكار المساء من الواجب قراءتها"
                , "ثلاث مرات"
                , 1));

        sebhaDao.insert(new SebhaModel("اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ."
                , "[أذكار]."
                , "أذكار الصباح من الواجب قراءتها"
                , "ثلاث مرات"
                , 1));

        sebhaDao.insert(new SebhaModel("أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ"
                , "[أذكار]."
                , "أذكار الصباح والمساء من الواجب قراءتها"
                , "ثلاث مرات"
                , 0));

        sebhaDao.insert(new SebhaModel("يَا رَبِّ، لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ، وَلِعَظِيمِ سُلْطَانِكَ."
                , "[أذكار]."
                , "أذكار الصباح والمساء من الواجب قراءتها"
                , "ثلاث مرات"
                , 1));

        sebhaDao.insert(new SebhaModel("اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا."
                , "[أذكار]."
                , "أذكار الصباح والمساء من الواجب قراءتها"
                , "ثلاث مرات"
                , 0));

        sebhaDao.insert(new SebhaModel("اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ، عَلَيْكَ تَوَكَّلْتُ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ، مَا شَاءَ اللَّهُ كَانَ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ، أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ."
                , "[أذكار]."
                , "أذكار الصباح والمساء من الواجب قراءتها"
                , "مرة واحدة"
                , 1));

        sebhaDao.insert(new SebhaModel("لا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ."
                , "[أذكار]."
                , "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان."
                , "مائة مرة"
                , 0));

        sebhaDao.insert(new SebhaModel("سُبْحـانَ اللهِ وَبِحَمْـدِهِ."
                , "[أذكار]."
                , "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ."
                , "مائة مرة"
                , 1));

        sebhaDao.insert(new SebhaModel("أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْه."
                , "[أذكار]."
                , "كتب له مائة حسنة ومحيت عنه مائة سيئة وكانت له حرزا من الشيطان يومه ذلك حتى يمسي"
                , "مائة مرة"
                , 0));

        sebhaDao.insert(new SebhaModel("قال رسول الله صلى الله عليه وسلم: (كُلُّ أُمَّتي يَدْخُلُونَ الجَنَّةَ إِلَّا مَن أَبَى، قالوا: يا رَسُولَ اللَّهِ، وَمَن يَأْبَى؟ قالَ: مَن أَطَاعَنِي دَخَلَ الجَنَّةَ، وَمَن عَصَانِي فقَدْ أَبَى)."
                , "[حديث شريف]."
                , ""
                , "صحيح البخاري"
                , 2));

        sebhaDao.insert(new SebhaModel("قال رسول الله صلى الله عليه وسلم: (خَيْرُكُمْ مَن تَعَلَّمَ القُرْآنَ وعَلَّمَهُ)."
                , "[حديث شريف]."
                , ""
                , "صحيح البخاري"
                , 2));

        sebhaDao.insert(new SebhaModel("قال رسول الله صلى الله عليه وسلم: (مَن مَاتَ وهْوَ يَدْعُو مِن دُونِ اللَّهِ نِدًّا دَخَلَ النَّارَ)."
                , "[حديث شريف]."
                , ""
                , "صحيح البخاري"
                , 2));

        sebhaDao.insert(new SebhaModel("قال رسول الله صلى الله عليه وسلم: (مَن تَرَكَ صَلَاةَ العَصْرِ حَبِطَ عَمَلُهُ)."
                , "[حديث شريف]."
                , ""
                , "صحيح البخاري"
                , 2));

        sebhaDao.insert(new SebhaModel("قال رسول الله صلى الله عليه وسلم: (إنَّ رِجَالًا يَتَخَوَّضُونَ في مَالِ اللَّهِ بغيرِ حَقٍّ، فَلَهُمُ النَّارُ يَومَ القِيَامَةِ)."
                , "[حديث شريف]."
                , ""
                , "صحيح البخاري"
                , 2));

        sebhaDao.insert(new SebhaModel("قال رسول الله صلى الله عليه وسلم: (لَعَنَ رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ المُتَشَبِّهِينَ مِنَ الرِّجَالِ بالنِّسَاءِ، والمُتَشَبِّهَاتِ مِنَ النِّسَاءِ بالرِّجَالِ)."
                , "[حديث شريف]."
                , ""
                , "صحيح البخاري"
                , 2));

        sebhaDao.insert(new SebhaModel("قال رسول الله صلى الله عليه وسلم: (لَا تُطْرُونِي، كما أَطْرَتِ النَّصَارَى ابْنَ مَرْيَمَ، فإنَّما أَنَا عَبْدُهُ، فَقُولوا عبدُ اللَّهِ، وَرَسُولُهُ)."
                , "[حديث شريف]."
                , ""
                , "صحيح البخاري"
                , 2));

        sebhaDao.insert(new SebhaModel("رُوي عن عائشة أم المؤمنين -رضي الله عنها- أنها قالت: (أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ كانَ لا يَدَعُ أرْبَعًا قَبْلَ الظُّهْرِ، ورَكْعَتَيْنِ قَبْلَ الغَدَاةِ)."
                , "[حديث شريف]."
                , ""
                , "صحيح البخاري"
                , 2));

        sebhaDao.insert(new SebhaModel("قال رسول الله صلى الله عليه وسلم: (مَن نَذَرَ أنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ، ومَن نَذَرَ أنْ يَعْصِيَهُ فلا يَعْصِهِ)."
                , "[حديث شريف]."
                , ""
                , "صحيح البخاري"
                , 2));

        sebhaDao.insert(new SebhaModel("قال رسول الله صلى الله عليه وسلم: (قالَ اللَّهُ تَبارَكَ وتَعالَى: أنا أغْنَى الشُّرَكاءِ عَنِ الشِّرْكِ، مَن عَمِلَ عَمَلًا أشْرَكَ فيه مَعِي غيرِي، تَرَكْتُهُ وشِرْكَهُ)."
                , "[حديث شريف]."
                , ""
                , "صحيح مسلم"
                , 2));

        sebhaDao.insert(new SebhaModel("قال رسول الله صلى الله عليه وسلم: (الْمُؤْمِنُ القَوِيُّ، خَيْرٌ وَأَحَبُّ إلى اللهِ مِنَ المُؤْمِنِ الضَّعِيفِ، وفي كُلٍّ خَيْرٌ احْرِصْ علَى ما يَنْفَعُكَ، وَاسْتَعِنْ باللَّهِ وَلَا تَعْجَزْ، وإنْ أَصَابَكَ شيءٌ، فلا تَقُلْ لو أَنِّي فَعَلْتُ كانَ كَذَا وَكَذَا، وَلَكِنْ قُلْ قَدَرُ اللهِ وَما شَاءَ فَعَلَ، فإنَّ لو تَفْتَحُ عَمَلَ الشَّيْطَانِ)."
                , "[حديث شريف]."
                , ""
                , "صحيح مسلم"
                , 2));

        sebhaDao.insert(new SebhaModel("قال رسول الله صلى الله عليه وسلم: (إنَّ اللَّهَ يَرْفَعُ بهذا الكِتَابِ أَقْوَامًا، وَيَضَعُ به آخَرِينَ)."
                , "[حديث شريف]."
                , ""
                , "صحيح مسلم"
                , 2));

        sebhaDao.insert(new SebhaModel("قال رسول الله صلى الله عليه وسلم: (لا تَجْعَلُوا بُيُوتَكُمْ مَقابِرَ، إنَّ الشَّيْطانَ يَنْفِرُ مِنَ البَيْتِ الذي تُقْرَأُ فيه سُورَةُ البَقَرَةِ)."
                , "[حديث شريف]."
                , ""
                , "صحيح مسلم"
                , 2));

        sebhaDao.insert(new SebhaModel("قال رسول الله صلى الله عليه وسلم: (مَن حَفِظَ عَشْرَ آياتٍ مِن أوَّلِ سُورَةِ الكَهْفِ عُصِمَ مِنَ الدَّجَّالِ)."
                , "[حديث شريف]."
                , ""
                , "صحيح مسلم"
                , 2));

        sebhaDao.insert(new SebhaModel("قال رسول الله صلى الله عليه وسلم: (مَن نَفَّسَ عن مُؤْمِنٍ كُرْبَةً مِن كُرَبِ الدُّنْيَا، نَفَّسَ اللَّهُ عنْه كُرْبَةً مِن كُرَبِ يَومِ القِيَامَةِ، وَمَن يَسَّرَ علَى مُعْسِرٍ، يَسَّرَ اللَّهُ عليه في الدُّنْيَا وَالآخِرَةِ، وَمَن سَتَرَ مُسْلِمًا، سَتَرَهُ اللَّهُ في الدُّنْيَا وَالآخِرَةِ، وَاللَّهُ في عَوْنِ العَبْدِ ما كانَ العَبْدُ في عَوْنِ أَخِيهِ، وَمَن سَلَكَ طَرِيقًا يَلْتَمِسُ فيه عِلْمًا، سَهَّلَ اللَّهُ له به طَرِيقًا إلى الجَنَّةِ، وَما اجْتَمع قَوْمٌ في بَيْتٍ مِن بُيُوتِ اللهِ، يَتْلُونَ كِتَابَ اللهِ، وَيَتَدَارَسُونَهُ بيْنَهُمْ، إِلَّا نَزَلَتْ عليهمِ السَّكِينَةُ، وَغَشِيَتْهُمُ الرَّحْمَةُ وَحَفَّتْهُمُ المَلَائِكَةُ، وَذَكَرَهُمُ اللَّهُ فِيمَن عِنْدَهُ، وَمَن بَطَّأَ به عَمَلُهُ، لَمْ يُسْرِعْ به نَسَبُهُ. غيرَ أنَّ حَدِيثَ أَبِي أُسَامَةَ ليسَ فيه ذِكْرُ التَّيْسِيرِ علَى المُعْسِرِ)."
                , "[حديث شريف]."
                , ""
                , "صحيح مسلم"
                , 2));
    }
}
